* Emacs changes


** DONE goto-chg ignores current line
** DONE no background for comments
** DONE search symbol with visualstar
** DONE Aggressive indent
** DONE switch themes
** DONE smart parens
** DONE no indent org
** DONE highlight TODO
** DONE Replace keybinding with general.el
** DONE add wgrep
** DONE add gR functionality
** DONE add iedit
** TODO yasnippet
#+NAME yasnippet
#+BEGIN_SRC bash :results raw replace
export YAS_LOAD="~/.emacs.d/elpa/yasnippet-20170828.1908"
export SNIPPETS_DIR="~/.dotfiles/emacs/snippets"
export ELISP_FILE="$(mktemp --suffix=.el /tmp/yas-XXXX)"
export TEST_FILE="$(mktemp --suffix=.el /tmp/yas-test-XXXX)"
echo "Loading script from ${ELISP_FILE}"
echo "Test file is ${TEST_FILE}"

cat << 'EOF' > "${ELISP_FILE}"
(add-to-list 'load-path (getenv "YAS_LOAD"))
(setq yas-snippets-dirs (getenv "SNIPPETS_DIR"))
(setq yas-verbosity 4)

(require 'yasnippet)
(yas/global-mode 1)

(insert "wcb")
(yas-expand)

(message (buffer-name))
(message (buffer-string))
EOF
# cat "${ELISP_FILE}"
emacs -Q -batch \
      --script "${ELISP_FILE}" \
      2>&1
#+END_SRC

#+RESULTS:
Loading script from /tmp/yas-cWDa.el
Test file is /tmp/yas-test-ii6q.el
[yas] !yas-minor-mode in *scratch* - lisp-interaction-mode
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas-minor-mode-on
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]   yas-minor-mode, setting variables for mode: prog-mode
[yas]   yas-minor-mode, load-pending-jits
[yas]   !yas--load-pending-jits
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas-minor-mode
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]     yas--load-pending-jits for mode: prog-mode
[yas] !yas-minor-mode in *Messages* - messages-buffer-mode
[yas]   !yas--modes-to-activate: mode=nil buffer=*Messages* caller=yas-minor-mode-on
[yas]     yas--modes-to-activate explored: (messages-buffer-mode special-mode)
[yas]   yas-minor-mode, setting variables for mode: special-mode
[yas]   yas-minor-mode, load-pending-jits
[yas]   !yas--load-pending-jits
[yas]   !yas--modes-to-activate: mode=nil buffer=*Messages* caller=yas-minor-mode
[yas]     yas--modes-to-activate explored: (messages-buffer-mode special-mode)
[yas]     yas--load-pending-jits for mode: special-mode
[yas] !yas-minor-mode in  *code-conversion-work* - fundamental-mode
[yas]   !yas--modes-to-activate: mode=nil buffer= *code-conversion-work* caller=yas-minor-mode-on
[yas]     yas--modes-to-activate explored: (fundamental-mode)
[yas]   yas-minor-mode, setting variables for mode: fundamental-mode
[yas]   yas-minor-mode, load-pending-jits
[yas]   !yas--load-pending-jits
[yas]   !yas--modes-to-activate: mode=nil buffer= *code-conversion-work* caller=yas-minor-mode
[yas]     yas--modes-to-activate explored: (fundamental-mode)
[yas]     yas--load-pending-jits for mode: fundamental-mode
[yas] !yas-minor-mode in  *load* - fundamental-mode
[yas]   !yas--modes-to-activate: mode=nil buffer= *load* caller=yas-minor-mode-on
[yas]     yas--modes-to-activate explored: (fundamental-mode)
[yas]   yas-minor-mode, setting variables for mode: fundamental-mode
[yas]   yas-minor-mode, load-pending-jits
[yas]   !yas--load-pending-jits
[yas]   !yas--modes-to-activate: mode=nil buffer= *load* caller=yas-minor-mode
[yas]     yas--modes-to-activate explored: (fundamental-mode)
[yas]     yas--load-pending-jits for mode: fundamental-mode
[yas] Discovered there was already *scratch* in lisp-interaction-mode
[yas]   !yas--load-pending-jits
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas-load-directory
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]     yas--load-pending-jits for mode: prog-mode
[yas] Loading for `prog-mode', just-in-time: #[128 \302\300\303\301""\207 [yas--load-directory-1 (/Users/jschaf/.emacs.d/elpa/yasnippet-20170828.1908/snippets/prog-mode prog-mode) apply append] 6 

(fn &rest ARGS2)]!
[yas] Loading snippet files from /Users/jschaf/.emacs.d/elpa/yasnippet-20170828.1908/snippets/prog-mode
[yas] Prepared just-in-time loading for /Users/jschaf/.emacs.d/elpa/yasnippet-20170828.1908/snippets
[yas] Prepared just-in-time loading for /Users/jschaf/.emacs.d/snippets
[yas] Prepared just-in-time loading of snippets successfully.
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas--templates-for-key-at-point
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas--templates-for-key-at-point
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas--templates-for-key-at-point
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas--templates-for-key-at-point
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
[yas]   !yas--modes-to-activate: mode=nil buffer=*scratch* caller=yas--templates-for-key-at-point
[yas]     yas--modes-to-activate explored: (lisp-interaction-mode emacs-lisp-mode prog-mode)
*scratch*
wcb
